from rates.rates import get_exchange_rates
from rates.cryptorates import parse_top_cryptorates


class Config:
    # # important varivables
    rates = get_exchange_rates()
    cryptorates = {}

    # list for crypto keyboard
    cryptolist = parse_top_cryptorates()


    # переменные функций
    clocks = ["🕛", "🕐", "🕑", "🕒", "🕓", "🕔", "🕕", "🕖", "🕗", "🕘", "🕙", "🕚"]
    msg = {}
    msg_keyboard = {}

    # terms of service
    terms_of_service = (
        "<b>Пользовательское соглашение</b>\n\n"
        "<i>1. Пользуясь ботом, вы соглашаетесь с условиями пользовательского соглашения.</i>\n"
        "<i>2. Ваши сохраненные данные <b>никому и никогда</b> не передаются.</i>\n"
        "<i>3. Данные о пользователях <b>никому и никогда</b> не передаются.</i>\n\n"
        "<b>Договор оферты</b>\n\n"
        "<i>1. Акцептом оферты считается оплата подписки.</i>\n"
        "<i>2. Оплата подписки принимается в звездах, в зависимости от выбранного плана.</i>\n"
        "<i>3. Возврат средств не предусмотрен. Оплата означает согласие с качеством услуг.</i>\n"
        "<i>4. Полный возврат производится в том случае, если услуга не была предоставлена.\n\n</i>"
        "<b>Изменения условий</b>\n\n"
        "<i>1. Сервис вправе вносить изменения в Договор, актуальная версия доступна в @koopeika_bot.</i>"
    )

    # словарь месяцев
    months = {
        1: "января",
        2: "февраля",
        3: "марта",
        4: "апреля",
        5: "мая",
        6: "июня",
        7: "июля",
        8: "августа",
        9: "сентября",
        10: "октября",
        11: "ноября",
        12: "декабря",
    }

    # часовые пояса
    tz_map = {
        "-12": "Pacific/Wake",
        "-11": "Pacific/Pago_Pago",
        "-10": "Pacific/Honolulu",
        "-9": "America/Anchorage",
        "-8": "America/Los_Angeles",
        "-7": "America/Denver",
        "-6": "America/Mexico_City",
        "-5": "America/New_York",
        "-4": "America/Port_of_Spain",
        "-3": "America/Montevideo",
        "-2": "Atlantic/South_Georgia",
        "-1": "Atlantic/Azores",
        "±0": "UTC",
        "+1": "Europe/Paris",
        "+2": "Europe/Athens",
        "+3": "Europe/Moscow",
        "+4": "Asia/Dubai",
        "+5": "Asia/Karachi",
        "+6": "Asia/Dhaka",
        "+7": "Asia/Bangkok",
        "+8": "Asia/Shanghai",
        "+9": "Asia/Tokyo",
        "+10": "Pacific/Port_Moresby",
        "+11": "Pacific/Noumea",
        "+12": "Pacific/Fiji",
        "+13": "Pacific/Tongatapu",
        "+14": "Pacific/Kiritimati",
    }

    # список валют
    crypto_max_coins = {
        16: "Стаднартный",
        28: "Большой",
        36: "Огромный",
        48: "Монструозный",
    }

    # все что связанное с отображением валют
    values = {
        "AUD": "🇦🇺 Австралийский доллар",
        "AZN": "🇦🇿 Азербайджанский манат",
        "BRL": "🇧🇷 Бразильский реал",
        "BYN": "🇧🇾 Белорусский рубль",
        "CAD": "🇨🇦 Канадский доллар",
        "CHF": "🇨🇭 Швейцарский франк",
        "CNY": "🇨🇳 Китайский юань",
        "CZK": "🇨🇿 Чешская крона",
        "DKK": "🇩🇰 Датская крона",
        "EUR": "🇪🇺 Евро",
        "GBP": "🇬🇧 Фунт стерлингов",
        "GEL": "🇬🇪 Грузинский лари",
        "IRR": "🇮🇷 Иранский риал",
        "INR": "🇮🇳 Индийская рупия",
        "JPY": "🇯🇵 Японская иена",
        "KWD": "🇰🇼 Кувейтский динар",
        "KGS": "🇰🇬 Киргизский сом",
        "KRW": "🇰🇷 Южнокорейская вона",
        "MYR": "🇲🇾 Малайзийский ринггит",
        "MDL": "🇲🇩 Молдавский лей",
        "MXN": "🇲🇽 Мексиканский песо",
        "NOK": "🇳🇴 Норвежская крона",
        "PLN": "🇵🇱 Польский злотый",
        "RUB": "🇷🇺 Российский рубль",
        "SAR": "🇸🇦 Саудовский риял",
        "SGD": "🇸🇬 Сингапурский доллар",
        "SEK": "🇸🇪 Шведская крона",
        "THB": "🇹🇭 Тайский бат",
        "TJS": "🇹🇯 Таджикский сомони",
        "TRY": "🇹🇷 Турецкая лира",
        "UAH": "🇺🇦 Украинская гривна",
        "USD": "🇺🇸 Доллар США",
        "UZS": "🇺🇿 Узбекский сум",
        "VND": "🇻🇳 Вьетнамский донг",
        "ZAR": "🇿🇦 Южноафриканский рэнд",
        "AED": "🇦🇪 Дирхам ОАЭ",
        "KZT": "🇰🇿 Казахстанский тенге",
        "BTC": "₿ Bitcoin",
        "ETH": "Ξ Ethereum",
        "SOL": "Solana",
        "TON": "The Open Network",
        "⭐️": "Telegram Stars",
        "⭐️buy": "Telegram Stars(покупка)",
        "⭐️sell": "Telegram Stars(продажа)",
    }

    styles_keys = {"symbols": "Символы", "codename": "Названия"}

    values_symbols = {
        "symbols": {
            "AUD": "$ (AUD)",
            "AZN": "₼",
            "BRL": "R$",
            "BYN": "Br",
            "CAD": "$ (CAD)",
            "CHF": "₣",
            "CNY": "¥ (CNY)",
            "CZK": "Kč",
            "DKK": "kr (DKK)",
            "EUR": "€",
            "GBP": "£",
            "GEL": "₾",
            "IRR": "﷼",
            "INR": "₹",
            "JPY": "¥ (JPY)",
            "KWD": "د.ك",
            "KGS": "сом",
            "KRW": "₩",
            "MYR": "RM",
            "MDL": "L (MDL)",
            "MXN": "$ (MXN)",
            "NOK": "kr (NOK)",
            "PLN": "zł",
            "RUB": "₽",
            "SAR": "﷼",
            "SGD": "$ (SGD)",
            "SEK": "kr (SEK)",
            "THB": "฿",
            "TJS": "ЅМ",
            "TRY": "₺",
            "UAH": "₴",
            "USD": "$",
            "UZS": "soʻm",
            "VND": "₫",
            "ZAR": "R",
            "AED": "د.إ",
            "KZT": "₸",
            "BTC": "₿",
            "ETH": " ETH",
            "SOL": " SOL",
            "TON": " TON",
            "⭐️": "⭐️",
            "⭐️buy": "⭐️",
            "⭐️sell": "⭐️",
        },
        "codename": {
            "AUD": " AUD",
            "AZN": " AZN",
            "BRL": " BRL",
            "BYN": " BYN",
            "CAD": " CAD",
            "CHF": " CHF",
            "CNY": " CNY",
            "CZK": " CZK",
            "DKK": " DKK",
            "EUR": " EUR",
            "GBP": " GBP",
            "GEL": " GEL",
            "IRR": " IRR",
            "INR": " INR",
            "JPY": " JPY",
            "KWD": " KWD",
            "KGS": " KGS",
            "KRW": " KRW",
            "MYR": " MYR",
            "MDL": " MDL",
            "MXN": " MXN",
            "NOK": " NOK",
            "PLN": " PLN",
            "RUB": " RUB",
            "SAR": " SAR",
            "SGD": " SGD",
            "SEK": " SEK",
            "THB": " THB",
            "TJS": " TJS",
            "TRY": " TRY",
            "UAH": " UAH",
            "USD": " USD",
            "UZS": " UZS",
            "VND": " VND",
            "ZAR": " ZAR",
            "AED": " AED",
            "KZT": " KZT",
            "BTC": " BTC",
            "ETH": " ETH",
            "SOL": " SOL",
            "TON": " TON",
            "⭐️": " Stars",
            "⭐️buy": " Stars",
            "⭐️sell": " Stars",
        },
    }

    max_num_values = {
        "AUD": 1_000_000,  # Австралийский доллар
        "AZN": 1_500_000,  # Азербайджанский манат
        "BRL": 4_000_000,  # Бразильский реал
        "BYN": 3_000_000,  # Белорусский рубль
        "CAD": 1_200_000,  # Канадский доллар
        "CHF": 800_000,  # Швейцарский франк
        "CNY": 7_000_000,  # Китайский юань
        "CZK": 23_000_000,  # Чешская крона
        "DKK": 6_000_000,  # Датская крона
        "EUR": 800_000,  # Евро
        "GBP": 800_000,  # Фунт стерлингов
        "GEL": 2_000_000,  # Грузинский лари
        "IRR": 40_000_000_000,  # Иранский риал
        "INR": 80_000_000,  # Индийская рупия
        "JPY": 150_000_000,  # Японская иена
        "KWD": 300_000,  # Кувейтский динар
        "KGS": 90_000_000,  # Киргизский сом
        "KRW": 1_300_000_000,  # Южнокорейская вона
        "MYR": 4_500_000,  # Малайзийский ринггит
        "MDL": 17_000_000,  # Молдавский лей
        "MXN": 17_000_000,  # Мексиканское песо
        "NOK": 10_000_000,  # Норвежская крона
        "PLN": 4_000_000,  # Польский злотый
        "RUB": 80_000_000,  # Российский рубль
        "SAR": 3_000_000,  # Саудовский риял
        "SGD": 1_200_000,  # Сингапурский доллар
        "SEK": 10_000_000,  # Шведская крона
        "THB": 36_000_000,  # Тайский бат
        "TJS": 11_000_000,  # Таджикский сомони
        "TRY": 32_000_000,  # Турецкая лира
        "UAH": 40_000_000,  # Украинская гривна
        "USD": 1_000_000,  # Доллар США
        "UZS": 12_000_000_000,  # Узбекский сум
        "VND": 25_000_000_000,  # Вьетнамский донг
        "ZAR": 15_000_000,  # Южноафриканский ранд
        "AED": 3_500_000,  # Дирхам ОАЭ
        "KZT": 500_000_000,  # Казахский тенге
        "BTC": 10,  # Биткойн
        "ETH": 300,  # Эфир
        "SOL": 8000,  # Solana
        "TON": 250_000,  # Toncoin
        "⭐️": 75_000_000,
        "⭐️buy": 70_000_000,  # Telegram Stars buy
        "⭐️sell": 75_000_000,  # Telegram Stars sell
    }

    max_num_values_premium = {
        "AUD": 1_000_000_000,  # Австралийский доллар
        "AZN": 1_500_000_000,  # Азербайджанский манат
        "BRL": 4_000_000_000,  # Бразильский реал
        "BYN": 3_000_000_000,  # Белорусский рубль
        "CAD": 1_200_000_000,  # Канадский доллар
        "CHF": 800_000_000,  # Швейцарский франк
        "CNY": 7_000_000_000,  # Китайский юань
        "CZK": 23_000_000_000,  # Чешская крона
        "DKK": 6_000_000_000,  # Датская крона
        "EUR": 800_000_000,  # Евро
        "GBP": 800_000_000,  # Фунт стерлингов
        "GEL": 2_000_000_000,  # Грузинский лари
        "IRR": 40_000_000_000_000,  # Иранский риал
        "INR": 80_000_000_000,  # Индийская рупия
        "JPY": 150_000_000_000,  # Японская иена
        "KWD": 300_000_000,  # Кувейтский динар
        "KGS": 90_000_000_000,  # Киргизский сом
        "KRW": 1_300_000_000_000,  # Южнокорейская вона
        "MYR": 4_500_000_000,  # Малайзийский ринггит
        "MDL": 17_000_000_000,  # Молдавский лей
        "MXN": 17_000_000_000,  # Мексиканское песо
        "NOK": 10_000_000_000,  # Норвежская крона
        "PLN": 4_000_000_000,  # Польский злотый
        "RUB": 80_000_000_000,  # Российский рубль
        "SAR": 3_000_000_000,  # Саудовский риял
        "SGD": 1_200_000_000,  # Сингапурский доллар
        "SEK": 10_000_000_000,  # Шведская крона
        "THB": 36_000_000_000,  # Тайский бат
        "TJS": 11_000_000_000,  # Таджикский сомони
        "TRY": 32_000_000_000,  # Турецкая лира
        "UAH": 40_000_000_000,  # Украинская гривна
        "USD": 1_000_000_000,  # Доллар США
        "UZS": 12_000_000_000_000,  # Узбекский сум
        "VND": 25_000_000_000_000,  # Вьетнамский донг
        "ZAR": 15_000_000_000,  # Южноафриканский ранд
        "AED": 3_500_000_000,  # Дирхам ОАЭ
        "KZT": 500_000_000_000,  # Казахский тенге
        "BTC": 10_000,  # Биткойн
        "ETH": 300_000,  # Эфир
        "SOL": 8_000_000,  # Solana
        "TON": 250_000_000,  # Toncoin
        "⭐️": 75_000_000_000,
        "⭐️buy": 70_000_000_000,  # Telegram Stars buy
        "⭐️sell": 75_000_000_000,  # Telegram Stars sell
    }

    max_con_values = {
        "USD": 1_000_000_000_000,  # United States Dollar
        "AED": 3_600_000_000_000_000,  # UAE Dirham
        "AUD": 1_500_000_000_000,  # Australian Dollar
        "AZN": 1_700_000_000_000_000,  # Azerbaijani Manat
        "BRL": 5_200_000_000_000_000,  # Brazilian Real
        "BTC": 65_000_000,  # Bitcoin
        "BYN": 3_300_000_000_000_000,  # Belarusian Ruble
        "CAD": 1_360_000_000_000,  # Canadian Dollar
        "CHF": 880_000_000_000,  # Swiss Franc
        "CNY": 7_300_000_000_000,  # Chinese Yuan
        "CZK": 23_000_000_000_000_000,  # Czech Koruna
        "DKK": 6_900_000_000_000_000,  # Danish Krone
        "ETH": 2_200_000_000,  # Ethereum
        "EUR": 900_000_000_000,  # Euro
        "GBP": 780_000_000_000,  # British Pound Sterling
        "GEL": 2_600_000_000_000_000,  # Georgian Lari
        "INR": 83_000_000_000_000,  # Indian Rupee
        "IRR": 42_000_000_000_000_000,  # Iranian Rial
        "JPY": 155_000_000_000_000,  # Japanese Yen
        "KGS": 91_000_000_000_000_000,  # Kyrgyzstani Som
        "KRW": 1_350_000_000_000_000,  # South Korean Won
        "KWD": 310_000_000_000_000,  # Kuwaiti Dinar
        "KZT": 460_000_000_000_000,  # Kazakhstani Tenge
        "MDL": 17_500_000_000_000_000,  # Moldovan Leu
        "MXN": 18_000_000_000_000_000,  # Mexican Peso
        "MYR": 5_000_000_000_000_000,  # Malaysian Ringgit
        "NOK": 11_000_000_000_000_000,  # Norwegian Krone
        "PLN": 4_000_000_000_000_000,  # Polish Zloty
        "RUB": 80_000_000_000_000,  # Russian Ruble
        "SAR": 3_750_000_000_000_000,  # Saudi Riyal
        "SEK": 10_000_000_000_000_000,  # Swedish Krona
        "SGD": 1_350_000_000_000,  # Singapore Dollar
        "SOL": 30_000_000_000,  # Solana
        "THB": 37_000_000_000_000_000,  # Thai Baht
        "TJS": 11_000_000_000_000_000,  # Tajikistani Somoni
        "TON": 500_000_000_000,  # Toncoin
        "TRY": 33_000_000_000_000_000,  # Turkish Lira
        "UAH": 41_000_000_000_000_000,  # Ukrainian Hryvnia
        "UZS": 12_600_000_000_000_000,  # Uzbekistani Som
        "VND": 25_500_000_000_000_000,  # Vietnamese Dong
        "ZAR": 18_000_000_000_000_000,  # South African Rand
        "⭐️": 8_000_000_000_000_000,  # Telegram Stars (Sell)
        "⭐️buy": 7_000_000_000_000_000,  # Telegram Stars (Buy)
        "⭐️sell": 8_000_000_000_000_000,  # Telegram Stars (Sell)
    }

    max_con_values_premium = {
        "USD": 1_000_000_000_000_000,  # United States Dollar
        "AED": 3_600_000_000_000_000_000,  # UAE Dirham
        "AUD": 1_500_000_000_000_000,  # Australian Dollar
        "AZN": 1_700_000_000_000_000_000,  # Azerbaijani Manat
        "BRL": 5_200_000_000_000_000_000,  # Brazilian Real
        "BTC": 65_000_000_000,  # Bitcoin
        "BYN": 3_300_000_000_000_000_000,  # Belarusian Ruble
        "CAD": 1_360_000_000_000_000,  # Canadian Dollar
        "CHF": 880_000_000_000_000,  # Swiss Franc
        "CNY": 7_300_000_000_000_000,  # Chinese Yuan
        "CZK": 23_000_000_000_000_000_000,  # Czech Koruna
        "DKK": 6_900_000_000_000_000_000,  # Danish Krone
        "ETH": 2_200_000_000_000,  # Ethereum
        "EUR": 900_000_000_000_000,  # Euro
        "GBP": 780_000_000_000_000,  # British Pound Sterling
        "GEL": 2_600_000_000_000_000_000,  # Georgian Lari
        "INR": 83_000_000_000_000_000,  # Indian Rupee
        "IRR": 42_000_000_000_000_000_000,  # Iranian Rial
        "JPY": 155_000_000_000_000_000,  # Japanese Yen
        "KGS": 91_000_000_000_000_000_000,  # Kyrgyzstani Som
        "KRW": 1_350_000_000_000_000_000,  # South Korean Won
        "KWD": 310_000_000_000_000_000,  # Kuwaiti Dinar
        "KZT": 460_000_000_000_000_000,  # Kazakhstani Tenge
        "MDL": 17_500_000_000_000_000_000,  # Moldovan Leu
        "MXN": 18_000_000_000_000_000_000,  # Mexican Peso
        "MYR": 5_000_000_000_000_000_000,  # Malaysian Ringgit
        "NOK": 11_000_000_000_000_000_000,  # Norwegian Krone
        "PLN": 4_000_000_000_000_000_000,  # Polish Zloty
        "RUB": 80_000_000_000_000_000,  # Russian Ruble
        "SAR": 3_750_000_000_000_000_000,  # Saudi Riyal
        "SEK": 10_000_000_000_000_000_000,  # Swedish Krona
        "SGD": 1_350_000_000_000_000,  # Singapore Dollar
        "SOL": 30_000_000_000_000,  # Solana
        "THB": 37_000_000_000_000_000_000,  # Thai Baht
        "TJS": 11_000_000_000_000_000_000,  # Tajikistani Somoni
        "TON": 500_000_000_000_000,  # Toncoin
        "TRY": 33_000_000_000_000_000_000,  # Turkish Lira
        "UAH": 41_000_000_000_000_000_000,  # Ukrainian Hryvnia
        "UZS": 12_600_000_000_000_000_000,  # Uzbekistani Som
        "VND": 25_500_000_000_000_000_000,  # Vietnamese Dong
        "ZAR": 18_000_000_000_000_000_000,  # South African Rand
        "⭐️": 8_000_000_000_000_000_000,  # Telegram Stars (Sell)
        "⭐️buy": 7_000_000_000_000_000_000,  # Telegram Stars (Buy)
        "⭐️sell": 8_000_000_000_000_000_000,  # Telegram Stars (Sell)
    }

    # списки стран
    currency_dict = {
        "asia": """<b>Азия</b>(кроме Ближнего Востока):
            🇦🇫 AFN - Афгани (Афганистан)
            🇦🇿 AZN - Азербайджанский манат (Азербайджан)
            🇦🇲 AMD - Армянский драм (Армения)
            🇧🇩 BDT - Бангладешская така (Бангладеш)
            🇧🇳 BND - Брунейский доллар (Бруней)
            🇰🇭 KHR - Камбоджийский риель (Камбоджа)
            🇬🇪 GEL - Грузинский лари (Грузия)
            🇮🇳 INR - Индийская рупия (Индия)
            🇮🇩 IDR - Индонезийская рупия (Индонезия)
            🇯🇴 JOD - Иорданский динар (Иордания)
            🇰🇿 KZT - Казахстанский тенге (Казахстан)
            🇰🇬 KGS - Киргизский сом (Киргизия)
            🇱🇦 LAK - Лаосский кип (Лаос)
            🇲🇳 MNT - Монгольский тугрик (Монголия)
            🇲🇾 MYR - Малайзийский ринггит (Малайзия)
            🇳🇵 NPR - Непальская рупия (Непал)
            🇸🇬 SGD - Сингапурский доллар (Сингапур)
            🇱🇰 LKR - Шри-ланкийская рупия (Шри-Ланка)
            🇹🇯 TJS - Таджикский сомони (Таджикистан)
            🇹🇭 THB - Тайский бат (Таиланд)
            🇹🇷 TRY - Турецкая лира (Турция)
            🇺🇿 UZS - Узбекский сум (Узбекистан)
            🇻🇳 VND - Вьетнамский донг (Вьетнам)
            🇰🇷 KRW - Южнокорейская вона (Южная Корея)
            🇯🇵 JPY - Японская иена (Япония)""",
        "europe": """<b>Европа:</b>
            🇦🇱 ALL - Албанский лек (Албания)
            🇧🇦 BAM - Конвертируемая марка (Босния и Герцеговина)
            🇧🇾 BYN - Белорусский рубль (Беларусь)
            🇧🇬 BGN - Болгарский лев (Болгария)
            🇭🇷 HRK - Хорватская куна (Хорватия)
            🇨🇾 CYP - Кипрский фунт (Кипр, устаревшая)
            🇩🇰 DKK - Датская крона (Дания)
            🇪🇺 EUR - Евро (Еврозона)
            🇭🇺 HUF - Венгерский форинт (Венгрия)
            🇮🇸 ISK - Исландская крона (Исландия)
            🇲🇩 MDL - Молдавский лей (Молдова)
            🇲🇪 EUR - Евро (Черногория, фактическое использование)
            🇳🇴 NOK - Норвежская крона (Норвегия)
            🇵🇱 PLN - Польский злотый (Польша)
            🇷🇴 RON - Румынский лей (Румыния)
            🇷🇺 RUB - Российский рубль (Россия)
            🇷🇸 RSD - Сербский динар (Сербия)
            🇸🇰 EUR - Евро (Словакия)
            🇸🇮 EUR - Евро (Словения)
            🇺🇦 UAH - Украинская гривна (Украина)
            🇬🇧 GBP - Фунт стерлингов (Великобритания)
            🇨🇿 CZK - Чешская крона (Чехия)
            🇸🇪 SEK - Шведская крона (Швеция)
            🇨🇭 CHF - Швейцарский франк (Швейцария)
            🌐 XDR - Специальные права заимствования (МВФ)""",
        "america": """<b>Америка:</b>
            🇦🇷 ARS - Аргентинское песо (Аргентина)
            🇧🇿 BZD - Белизский доллар (Белиз)
            🇧🇴 BOB - Боливиано (Боливия)
            🇧🇷 BRL - Бразильский реал (Бразилия)
            🇨🇱 CLP - Чилийское песо (Чили)
            🇨🇴 COP - Колумбийское песо (Колумбия)
            🇨🇷 CRC - Коста-риканский колон (Коста-Рика)
            🇩🇴 DOP - Доминиканский песо (Доминикана)
            🇪🇨 USD - Доллар США (Эквадор)
            🇬🇹 GTQ - Кетсаль (Гватемала)
            🇭🇳 HNL - Лемпира (Гондурас)
            🇲🇽 MXN - Мексиканский песо (Мексика)
            🇳🇮 NIO - Золотая кордоба (Никарагуа)
            🇵🇦 PAB - Бальбоа (Панама)
            🇵🇾 PYG - Парагвайский гуарани (Парагвай)
            🇵🇪 PEN - Новый соль (Перу)
            🇸🇻 SVC - Сальвадорский колон (Сальвадор)
            🇹🇹 TTD - Доллар Тринидада и Тобаго
            🇺🇸 USD - Доллар США (США)
            🇺🇾 UYU - Уругвайское песо (Уругвай)
            🇻🇪 VES - Венесуэльский боливар (Венесуэла)
            🇨🇦 CAD - Канадский доллар (Канада)""",
        "africa": """<b>Африка и Ближний Восток:</b>
            🇩🇿 DZD - Алжирский динар (Алжир)
            🇦🇴 AOA - Ангольская кванза (Ангола)
            🇪🇬 EGP - Египетский фунт (Египет)
            🇪🇹 ETB - Эфиопский быр (Эфиопия)
            🇬🇭 GHS - Ганский седи (Гана)
            🇰🇪 KES - Кенийский шиллинг (Кения)
            🇲🇬 MGA - Малагасийский ариари (Мадагаскар)
            🇲🇦 MAD - Марокканский дирхам (Марокко)
            🇳🇬 NGN - Найра (Нигерия)
            🇿🇼 ZWL - Зимбабвийский доллар (Зимбабве)
            🇶🇦 QAR - Катарский риал (Катар)
            🇦🇪 AED - Дирхам ОАЭ (ОАЭ)
            🇸🇦 SAR - Саудовский риял (Саудовская Аравия)
            🇰🇼 KWD - Кувейтский динар (Кувейт)
            🇮🇷 IRR - Иранский риал (Иран)
            🇿🇦 ZAR - Южноафриканский рэнд (ЮАР)""",
        "oceania": """<b>Океания:</b>
            🇦🇺 AUD - Австралийский доллар (Австралия)
            🇳🇿 NZD - Новозеландский доллар (Новая Зеландия)
            🇵🇬 PGK - Кина (Папуа – Новая Гвинея)
            🇫🇯 FJD - Фиджийский доллар (Фиджи)
            🇻🇺 VUV - Вату (Вануату)
            🇼🇸 WST - Самоанская тала (Самоа)
            🇰🇮 AUD - Австралийский доллар (Кирибати)
            🇹🇴 TOP - Паанга (Тонга)
            🇸🇧 SBD - Соломоновых островов доллар""",
        "values": """<b>Топ 10 популярных валют:</b>
            🇺🇸 USD — Доллар США
            🇪🇺 EUR — Евро
            🇯🇵 JPY — Японская иена
            🇬🇧 GBP — Фунт стерлингов
            🇨🇭 CHF — Швейцарский франк
            🇨🇦 CAD — Канадский доллар
            🇦🇺 AUD — Австралийский доллар
            🇨🇳 CNY — Китайский юань
            🇳🇿 NZD — Новозеландский доллар
            🇸🇪 SEK — Шведская крона""",
        "crypto": """<b>Популярные криптовалюты:</b>
            1. <b>BTC</b> — Bitcoin
            2. <b>ETH</b> — Ethereum
            3. <b>BNB</b> — Binance Coin
            4. <b>SOL</b> — Solana
            5. <b>XRP</b> — Ripple
            6. <b>TON</b> — Toncoin
            7. <b>ADA</b> — Cardano
            8. <b>AVAX</b> — Avalanche
            9. <b>DOGE</b> — Dogecoin
            10. <b>TRX</b> — TRON""",
        "stars": """<b>Telegram Stars(⭐️)</b>
        Данный курс является приблизительным и может отличаться с разницей до 10%.
        Курс покупки звезд <b>дороже</b> чем курс продажи.
        Курс покупки звезд считается по курсу SPLIT/FRAGMENT
        Покупка звезд на <a href="https://split.tg/">SPLIT</a>(без <b>KYC*</b>)
        Покупка звезд на <a href="https://fragment.com/stars">FRAGMENT</a>(с <b>KYC*</b>).
        *KYC - Верификация по документам""",
    }

    # title for payments in stars
    title_stars = {
        30: "Подписка на месяц",
        90: "Подписка на 3 месяца",
        180: "Подписка на 6 месяцев",
        365: "Подписка на 12 месяцев",
    }

    title_stars_price = {
        30: 60,
        90: 150,
        180: 250,
        365: 400,
    }

    title_stars_for_db = {
        30: "premium_stars_30",
        90: "premium_stars_90",
        180: "premium_stars_180",
        365: "premium_stars_365",
    }
